#include "stdafx.h"
#include <iostream>

using namespace std;

void GeneralMenu(){
	cout << "Выберите лабораторную работу:" << endl <<
		"1.Основные элементы языка Си++" << endl <<
		"2.Функции, указатели и адресная арифметика" << endl <<
		"3.Массивы и строки" << endl <<
		"4.Работа с динамической памятью" << endl <<
		"5.Работа с классами" << endl <<
		"Backspace. Выход из программы" << endl << endl;
}

void SecondLabMenu() {
	cout << "Лабораторная №2." << endl << "Выберите номер задания:" << endl <<
		"1.Расчет квадратных уравнений" << endl <<
		"2.Расчет квадратных уравнений2" << endl <<
		"3.Возведение в степень" << endl <<
		"4.Угадать число" << endl <<
		"Backspace. Перейти к выбору лабораторной" << endl << endl;
}

void ThirdLabMenu() {
	cout << "Лабораторная №3." << endl << "Выберите номер задания:" << endl <<
		"1.Сортировка массива" << endl <<
		"2.Перемножение двух матриц" << endl <<
		"3.Вычисление длины строки и вхождение в нее определенного символа" << endl <<
		"4.Создание подстроки из введенной строки" << endl <<
		"5.Работа с путем файла" << endl <<
		"Backspace. Вернуться к выбору программы" << endl << endl;
}

void FourthLabMenu() {
	cout << "Лабораторная №4." << endl << "Выберите номер задания:" << endl <<
		"1.Выбор дня недели" << endl <<
		"2.Выбор месяца" << endl <<
		"3.Работа с цветом" << endl <<
		"4.Работа со структурами" << endl <<
		"5.Работа со списком Vector" << endl <<
		"6.Дополнительные задания" << endl << 
		"Backspace. Перейти к выбору лабораторных" << endl << endl;
}

void FifthLabMenu() {
	cout << "Лабораторная №2." << endl << "Выберите номер задания:" << endl <<
		"1.Работа с классами" << endl << endl;
}